In [1]:
import pandas as pd

#importting pandas as pd
import pandas as pd

#creating the DataFrame
df = pd.DataFrame({"X":[12,4,5,None,1],
                  "Y":[7,2,54,3,None],
                  "Z":[20,16,11,3,8],
                  "D":[14,3,None,2,6]})

#Create the index
index_ = ['Row_1','Row_2','Row_3','Row_4','Row_5']

#Set the index
df.index = index_

#Print the DataFrame
df

          X     Y   Z     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [2]:
#use DataFrame.transform function to add 10 to each element of the DataFrame

result =df.transform(func=lambda x : x +10)
result

          X     Y   Z     D
Row_1  22.0  17.0  30  24.0
Row_2  14.0  12.0  26  13.0
Row_3  15.0  64.0  21   NaN
Row_4   NaN  13.0  13  12.0
Row_5  11.0   NaN  18  16.0

In [6]:
#Use DataFrame function to find the square root and the result of the euler's number raised to each element of the DataFrame

#importing pandas as pd
import pandas as pd

#creating the dataFrame
df=pd.DataFrame({"X":[12,4,5,None,1],
                "Y":[7,2,54,3,None],
                "Z":[20,16,11,3,8],
                "D":[14,3,None,2,6]})

#Create the index
index_ = ['Row_1','Row_2','Row_3','Row_4','Row_5']

#set the index
df.index = index_

#print the DataFrame
print(df)

          X     Y   Z     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [7]:
result = df.transform(func =['sqrt','exp'])
result

              X                        Y                       Z  \
           sqrt            exp      sqrt           exp      sqrt
Row_1  3.464102  162754.791419  2.645751  1.096633e+03  4.472136
Row_2  2.000000      54.598150  1.414214  7.389056e+00  4.000000
Row_3  2.236068     148.413159  7.348469  2.830753e+23  3.316625
Row_4       NaN            NaN  1.732051  2.008554e+01  1.732051
Row_5  1.000000       2.718282       NaN           NaN  2.828427

                            D
                exp      sqrt           exp
Row_1  4.851652e+08  3.741657  1.202604e+06
Row_2  8.886111e+06  1.732051  2.008554e+01
Row_3  5.987414e+04       NaN           NaN
Row_4  2.008554e+01  1.414214  7.389056e+00
Row_5  2.980958e+03  2.449490  4.034288e+02

In [9]:
#Python3 program to show the working of upper() function

text ='thiS iS aN pYTHon clASS'

#upper() function to convert
#string to upper case
print(text.upper())

# lower() function to convert
# string to lower case
print("\nConverted String to lower case:")
print(text.lower())

# converts the first character to
# upper case and rest to lower case
print("\nConverted first letter to upper in every word:")
print(text.title())

#swaps the case of all characters in the string
# upper case character to lowercase and viceversa
print("\nString Case Swapping:")
print(text.swapcase())

# convert the first character of a string to uppercase
print("\nConverted String first leeer to upper:")
print(text.capitalize())

# original string never changes
print("\nOriginal String")
print(text)

THIS IS AN PYTHON CLASS

Converted String to lower case:
this is an python class

Converted first letter to upper in every word:
This Is An Python Class

String Case Swapping:
THIs Is An PythON CLass

Converted String first leeer to upper:
This is an python class

Original String
thiS iS aN pYTHon clASS